LoadTesting/API_Ping_1000-Production.txt
Run #1:

Running 2m test @ https://api.thriveglobal.com
  12 threads and 12 connections
  Thread calibration: mean lat.: 4500.561ms, rate sampling interval: 15761ms
  Thread calibration: mean lat.: 4524.707ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 4499.127ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4524.810ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 4493.247ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 4500.058ms, rate sampling interval: 15761ms
  Thread calibration: mean lat.: 4492.495ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 4498.662ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4491.573ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 4506.533ms, rate sampling interval: 15753ms
  Thread calibration: mean lat.: 4499.769ms, rate sampling interval: 15761ms
  Thread calibration: mean lat.: 4492.923ms, rate sampling interval: 15687ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.92m    27.41s    1.72m    57.36%
    Req/Sec    11.05      0.39    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91m
 75.000%    1.32m
 90.000%    1.56m
 99.000%    1.71m
 99.900%    1.72m
 99.990%    1.72m
 99.999%    1.73m
100.000%    1.73m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8675.327     0.000000            2         1.00
   17776.639     0.100000         1534         1.11
   27049.983     0.200000         3063         1.25
   36503.551     0.300000         4595         1.43
   45580.287     0.400000         6125         1.67
   54722.559     0.500000         7658         2.00
   59473.919     0.550000         8422         2.22
   64421.887     0.600000         9187         2.50
   69009.407     0.650000         9956         2.86
   74317.823     0.700000        10721         3.33
   79298.559     0.750000        11486         4.00
   82051.071     0.775000        11864         4.44
   84475.903     0.800000        12253         5.00
   86835.199     0.825000        12639         5.71
   89128.959     0.850000        13014         6.67
   91488.255     0.875000        13399         8.00
   92667.903     0.887500        13593         8.89
   93782.015     0.900000        13778        10.00
   94961.663     0.912500        13975        11.43
   96141.311     0.925000        14171        13.33
   97320.959     0.937500        14363        16.00
   97910.783     0.943750        14458        17.78
   98566.143     0.950000        14546        20.00
   99155.967     0.956250        14644        22.86
   99745.791     0.962500        14741        26.67
  100401.151     0.968750        14831        32.00
  100728.831     0.971875        14885        35.56
  100990.975     0.975000        14928        40.00
  101318.655     0.978125        14985        45.71
  101580.799     0.981250        15030        53.33
  101842.943     0.984375        15074        64.00
  101974.015     0.985938        15095        71.11
  102170.623     0.987500        15125        80.00
  102301.695     0.989062        15146        91.43
  102498.303     0.990625        15176       106.67
  102629.375     0.992188        15197       128.00
  102694.911     0.992969        15206       142.22
  102760.447     0.993750        15218       160.00
  102825.983     0.994531        15229       182.86
  102891.519     0.995313        15241       213.33
  102957.055     0.996094        15251       256.00
  103022.591     0.996484        15261       284.44
  103022.591     0.996875        15261       320.00
  103088.127     0.997266        15272       365.71
  103153.663     0.997656        15282       426.67
  103153.663     0.998047        15282       512.00
  103153.663     0.998242        15282       568.89
  103219.199     0.998437        15292       640.00
  103219.199     0.998633        15292       731.43
  103219.199     0.998828        15292       853.33
  103284.735     0.999023        15298      1024.00
  103284.735     0.999121        15298      1137.78
  103284.735     0.999219        15298      1280.00
  103284.735     0.999316        15298      1462.86
  103350.271     0.999414        15302      1706.67
  103350.271     0.999512        15302      2048.00
  103350.271     0.999561        15302      2275.56
  103415.807     0.999609        15304      2560.00
  103415.807     0.999658        15304      2925.71
  103415.807     0.999707        15304      3413.33
  103481.343     0.999756        15306      4096.00
  103481.343     0.999780        15306      4551.11
  103481.343     0.999805        15306      5120.00
  103481.343     0.999829        15306      5851.43
  103481.343     0.999854        15306      6826.67
  103546.879     0.999878        15308      8192.00
  103546.879     1.000000        15308          inf
#[Mean    =    55443.008, StdDeviation   =    27410.442]
#[Max     =   103481.344, Total count    =        15308]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16680 requests in 2.00m, 4.57MB read
  Non-2xx or 3xx responses: 16680
Requests/sec:    138.94
Transfer/sec:     38.94KB

Run #2:

Running 2m test @ https://api.thriveglobal.com
  12 threads and 12 connections
  Thread calibration: mean lat.: 4497.253ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 4563.955ms, rate sampling interval: 15736ms
  Thread calibration: mean lat.: 4539.409ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 4496.913ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 4496.602ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 4565.774ms, rate sampling interval: 15736ms
  Thread calibration: mean lat.: 4535.960ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 4542.326ms, rate sampling interval: 15687ms
  Thread calibration: mean lat.: 4522.014ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 4497.182ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 4496.803ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 4496.540ms, rate sampling interval: 15613ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94m    27.70s    1.73m    57.18%
    Req/Sec    10.83      0.49    12.00     98.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93m
 75.000%    1.34m
 90.000%    1.58m
 99.000%    1.71m
 99.900%    1.73m
 99.990%    1.73m
 99.999%    1.73m
100.000%    1.73m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8691.711     0.000000            6         1.00
   17809.407     0.100000         1502         1.11
   27213.823     0.200000         3003         1.25
   36863.999     0.300000         4507         1.43
   46727.167     0.400000         6007         1.67
   55934.975     0.500000         7505         2.00
   60456.959     0.550000         8257         2.22
   65011.711     0.600000         9009         2.50
   69533.695     0.650000         9760         2.86
   75825.151     0.700000        10515         3.33
   80412.671     0.750000        11257         4.00
   83034.111     0.775000        11643         4.44
   85524.479     0.800000        12013         5.00
   87949.311     0.825000        12389         5.71
   90177.535     0.850000        12764         6.67
   92471.295     0.875000        13135         8.00
   93716.479     0.887500        13325         8.89
   94830.591     0.900000        13515        10.00
   95879.167     0.912500        13697        11.43
   96993.279     0.925000        13886        13.33
   98107.391     0.937500        14073        16.00
   98631.679     0.943750        14165        17.78
   99221.503     0.950000        14262        20.00
   99811.327     0.956250        14360        22.86
  100401.151     0.962500        14457        26.67
  100925.439     0.968750        14542        32.00
  101187.583     0.971875        14589        35.56
  101515.263     0.975000        14640        40.00
  101777.407     0.978125        14687        45.71
  102039.551     0.981250        14728        53.33
  102301.695     0.984375        14775        64.00
  102432.767     0.985938        14799        71.11
  102629.375     0.987500        14829        80.00
  102760.447     0.989062        14851        91.43
  102891.519     0.990625        14871       106.67
  103022.591     0.992188        14895       128.00
  103088.127     0.992969        14907       142.22
  103153.663     0.993750        14918       160.00
  103219.199     0.994531        14929       182.86
  103284.735     0.995313        14941       213.33
  103350.271     0.996094        14953       256.00
  103415.807     0.996484        14964       284.44
  103415.807     0.996875        14964       320.00
  103481.343     0.997266        14975       365.71
  103481.343     0.997656        14975       426.67
  103546.879     0.998047        14984       512.00
  103546.879     0.998242        14984       568.89
  103612.415     0.998437        14994       640.00
  103612.415     0.998633        14994       731.43
  103612.415     0.998828        14994       853.33
  103677.951     0.999023        14999      1024.00
  103677.951     0.999121        14999      1137.78
  103677.951     0.999219        14999      1280.00
  103677.951     0.999316        14999      1462.86
  103743.487     0.999414        15003      1706.67
  103743.487     0.999512        15003      2048.00
  103743.487     0.999561        15003      2275.56
  103809.023     0.999609        15006      2560.00
  103809.023     0.999658        15006      2925.71
  103809.023     0.999707        15006      3413.33
  103809.023     0.999756        15006      4096.00
  103809.023     0.999780        15006      4551.11
  103874.559     0.999805        15009      5120.00
  103874.559     1.000000        15009          inf
#[Mean    =    56125.882, StdDeviation   =    27700.136]
#[Max     =   103809.024, Total count    =        15009]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16355 requests in 2.00m, 4.48MB read
  Non-2xx or 3xx responses: 16355
Requests/sec:    136.21
Transfer/sec:     38.18KB

Run #3:

Running 2m test @ https://api.thriveglobal.com
  12 threads and 12 connections
  Thread calibration: mean lat.: 5181.171ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 5181.258ms, rate sampling interval: 15917ms
  Thread calibration: mean lat.: 5246.151ms, rate sampling interval: 15949ms
  Thread calibration: mean lat.: 5177.737ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5135.119ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 5107.505ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 5152.432ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5181.758ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5151.712ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 5132.651ms, rate sampling interval: 15892ms
  Thread calibration: mean lat.: 5108.979ms, rate sampling interval: 15900ms
  Thread calibration: mean lat.: 5177.200ms, rate sampling interval: 15925ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95m    27.54s    1.74m    57.81%
    Req/Sec    10.53      0.50    11.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95m
 75.000%    1.34m
 90.000%    1.58m
 99.000%    1.73m
 99.900%    1.74m
 99.990%    1.74m
 99.999%    1.74m
100.000%    1.74m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9019.391     0.000000            2         1.00
   18710.527     0.100000         1457         1.11
   28114.943     0.200000         2911         1.25
   37617.663     0.300000         4371         1.43
   46891.007     0.400000         5825         1.67
   56819.711     0.500000         7280         2.00
   61636.607     0.550000         8007         2.22
   66158.591     0.600000         8740         2.50
   70778.879     0.650000         9465         2.86
   75431.935     0.700000        10190         3.33
   80674.815     0.750000        10918         4.00
   83034.111     0.775000        11284         4.44
   85590.015     0.800000        11646         5.00
   87949.311     0.825000        12011         5.71
   90308.607     0.850000        12372         6.67
   92602.367     0.875000        12737         8.00
   93716.479     0.887500        12917         8.89
   94896.127     0.900000        13102        10.00
   96141.311     0.912500        13281        11.43
   97320.959     0.925000        13470        13.33
   98500.607     0.937500        13655        16.00
   99090.431     0.943750        13744        17.78
   99614.719     0.950000        13827        20.00
  100204.543     0.956250        13923        22.86
  100728.831     0.962500        14009        26.67
  101384.191     0.968750        14105        32.00
  101777.407     0.971875        14148        35.56
  102105.087     0.975000        14192        40.00
  102432.767     0.978125        14239        45.71
  102694.911     0.981250        14282        53.33
  103022.591     0.984375        14332        64.00
  103153.663     0.985938        14353        71.11
  103284.735     0.987500        14373        80.00
  103415.807     0.989062        14395        91.43
  103612.415     0.990625        14427       106.67
  103743.487     0.992188        14449       128.00
  103809.023     0.992969        14459       142.22
  103874.559     0.993750        14467       160.00
  103940.095     0.994531        14476       182.86
  104005.631     0.995313        14487       213.33
  104136.703     0.996094        14502       256.00
  104202.239     0.996484        14512       284.44
  104202.239     0.996875        14512       320.00
  104267.775     0.997266        14522       365.71
  104267.775     0.997656        14522       426.67
  104333.311     0.998047        14532       512.00
  104333.311     0.998242        14532       568.89
  104333.311     0.998437        14532       640.00
  104398.847     0.998633        14540       731.43
  104398.847     0.998828        14540       853.33
  104398.847     0.999023        14540      1024.00
  104464.383     0.999121        14549      1137.78
  104464.383     0.999219        14549      1280.00
  104464.383     0.999316        14549      1462.86
  104464.383     0.999414        14549      1706.67
  104464.383     0.999512        14549      2048.00
  104464.383     0.999561        14549      2275.56
  104464.383     0.999609        14549      2560.00
  104529.919     0.999658        14553      2925.71
  104529.919     0.999707        14553      3413.33
  104529.919     0.999756        14553      4096.00
  104529.919     0.999780        14553      4551.11
  104529.919     0.999805        14553      5120.00
  104529.919     0.999829        14553      5851.43
  104529.919     0.999854        14553      6826.67
  104529.919     0.999878        14553      8192.00
  104529.919     0.999890        14553      9102.22
  104529.919     0.999902        14553     10240.00
  104529.919     0.999915        14553     11702.86
  104529.919     0.999927        14553     13653.33
  104595.455     0.999939        14554     16384.00
  104595.455     1.000000        14554          inf
#[Mean    =    56709.534, StdDeviation   =    27540.785]
#[Max     =   104529.920, Total count    =        14554]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15549 requests in 2.00m, 4.26MB read
  Non-2xx or 3xx responses: 15549
Requests/sec:    129.51
Transfer/sec:     36.30KB

Run #4:

Running 2m test @ https://api.thriveglobal.com
  12 threads and 23 connections
  Thread calibration: mean lat.: 4383.963ms, rate sampling interval: 15138ms
  Thread calibration: mean lat.: 4488.625ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 4455.696ms, rate sampling interval: 15605ms
  Thread calibration: mean lat.: 4510.935ms, rate sampling interval: 15523ms
  Thread calibration: mean lat.: 4522.595ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 4502.017ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 4482.508ms, rate sampling interval: 15433ms
  Thread calibration: mean lat.: 4512.624ms, rate sampling interval: 15605ms
  Thread calibration: mean lat.: 4477.388ms, rate sampling interval: 15523ms
  Thread calibration: mean lat.: 4450.369ms, rate sampling interval: 15474ms
  Thread calibration: mean lat.: 4518.312ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 4483.053ms, rate sampling interval: 15548ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94m    27.30s    1.72m    57.47%
    Req/Sec    11.04      0.19    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.94m
 75.000%    1.33m
 90.000%    1.57m
 99.000%    1.71m
 99.900%    1.72m
 99.990%    1.72m
 99.999%    1.72m
100.000%    1.72m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8609.791     0.000000            1         1.00
   18481.151     0.100000         1549         1.11
   27738.111     0.200000         3095         1.25
   37224.447     0.300000         4642         1.43
   46792.703     0.400000         6192         1.67
   56295.423     0.500000         7737         2.00
   60981.247     0.550000         8511         2.22
   65699.839     0.600000         9285         2.50
   70451.199     0.650000        10066         2.86
   75235.327     0.700000        10836         3.33
   79953.919     0.750000        11614         4.00
   82313.215     0.775000        11994         4.44
   84738.047     0.800000        12383         5.00
   87031.807     0.825000        12774         5.71
   89391.103     0.850000        13160         6.67
   91684.863     0.875000        13539         8.00
   92864.511     0.887500        13740         8.89
   93978.623     0.900000        13933        10.00
   95158.271     0.912500        14122        11.43
   96337.919     0.925000        14323        13.33
   97452.031     0.937500        14508        16.00
   98041.855     0.943750        14605        17.78
   98631.679     0.950000        14706        20.00
   99221.503     0.956250        14803        22.86
   99811.327     0.962500        14900        26.67
  100401.151     0.968750        15000        32.00
  100663.295     0.971875        15041        35.56
  100990.975     0.975000        15097        40.00
  101253.119     0.978125        15143        45.71
  101515.263     0.981250        15189        53.33
  101777.407     0.984375        15232        64.00
  101974.015     0.985938        15264        71.11
  102105.087     0.987500        15287        80.00
  102236.159     0.989062        15310        91.43
  102367.231     0.990625        15334       106.67
  102498.303     0.992188        15354       128.00
  102563.839     0.992969        15366       142.22
  102629.375     0.993750        15377       160.00
  102760.447     0.994531        15400       182.86
  102825.983     0.995313        15410       213.33
  102891.519     0.996094        15422       256.00
  102891.519     0.996484        15422       284.44
  102957.055     0.996875        15434       320.00
  102957.055     0.997266        15434       365.71
  103022.591     0.997656        15444       426.67
  103022.591     0.998047        15444       512.00
  103088.127     0.998242        15455       568.89
  103088.127     0.998437        15455       640.00
  103088.127     0.998633        15455       731.43
  103088.127     0.998828        15455       853.33
  103153.663     0.999023        15464      1024.00
  103153.663     0.999121        15464      1137.78
  103153.663     0.999219        15464      1280.00
  103153.663     0.999316        15464      1462.86
  103153.663     0.999414        15464      1706.67
  103219.199     0.999512        15468      2048.00
  103219.199     0.999561        15468      2275.56
  103219.199     0.999609        15468      2560.00
  103219.199     0.999658        15468      2925.71
  103284.735     0.999707        15472      3413.33
  103284.735     0.999756        15472      4096.00
  103284.735     0.999780        15472      4551.11
  103284.735     0.999805        15472      5120.00
  103284.735     0.999829        15472      5851.43
  103284.735     0.999854        15472      6826.67
  103284.735     0.999878        15472      8192.00
  103284.735     0.999890        15472      9102.22
  103284.735     0.999902        15472     10240.00
  103284.735     0.999915        15472     11702.86
  103284.735     0.999927        15472     13653.33
  103350.271     0.999939        15473     16384.00
  103350.271     1.000000        15473          inf
#[Mean    =    56195.118, StdDeviation   =    27302.963]
#[Max     =   103284.736, Total count    =        15473]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16862 requests in 2.00m, 4.62MB read
  Socket errors: connect 0, read 12, write 0, timeout 0
  Non-2xx or 3xx responses: 16862
Requests/sec:    140.43
Transfer/sec:     39.36KB

Run #5:

Running 2m test @ https://api.thriveglobal.com
  12 threads and 23 connections
  Thread calibration: mean lat.: 4463.575ms, rate sampling interval: 15523ms
  Thread calibration: mean lat.: 4473.848ms, rate sampling interval: 15523ms
  Thread calibration: mean lat.: 4523.180ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 4471.425ms, rate sampling interval: 15523ms
  Thread calibration: mean lat.: 4508.236ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 4524.095ms, rate sampling interval: 15679ms
  Thread calibration: mean lat.: 4509.499ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4477.520ms, rate sampling interval: 15564ms
  Thread calibration: mean lat.: 4475.026ms, rate sampling interval: 15572ms
  Thread calibration: mean lat.: 4502.012ms, rate sampling interval: 15597ms
  Thread calibration: mean lat.: 4472.078ms, rate sampling interval: 15564ms
  Thread calibration: mean lat.: 4506.108ms, rate sampling interval: 15679ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94m    27.51s    1.73m    57.76%
    Req/Sec    10.86      0.35    11.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93m
 75.000%    1.34m
 90.000%    1.57m
 99.000%    1.71m
 99.900%    1.73m
 99.990%    1.73m
 99.999%    1.73m
100.000%    1.73m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8699.903     0.000000            6         1.00
   18137.087     0.100000         1510         1.11
   28065.791     0.200000         3019         1.25
   37126.143     0.300000         4530         1.43
   46268.415     0.400000         6043         1.67
   55574.527     0.500000         7547         2.00
   60260.351     0.550000         8301         2.22
   64847.871     0.600000         9057         2.50
   71237.631     0.650000         9812         2.86
   75890.687     0.700000        10571         3.33
   80412.671     0.750000        11318         4.00
   82837.503     0.775000        11698         4.44
   85131.263     0.800000        12083         5.00
   87359.487     0.825000        12454         5.71
   89587.711     0.850000        12830         6.67
   91947.007     0.875000        13204         8.00
   93126.655     0.887500        13398         8.89
   94371.839     0.900000        13590        10.00
   95551.487     0.912500        13779        11.43
   96731.135     0.925000        13964        13.33
   97910.783     0.937500        14156        16.00
   98435.071     0.943750        14242        17.78
   99024.895     0.950000        14337        20.00
   99614.719     0.956250        14437        22.86
  100139.007     0.962500        14525        26.67
  100728.831     0.968750        14625        32.00
  100990.975     0.971875        14669        35.56
  101318.655     0.975000        14723        40.00
  101580.799     0.978125        14763        45.71
  101842.943     0.981250        14808        53.33
  102105.087     0.984375        14855        64.00
  102236.159     0.985938        14878        71.11
  102432.767     0.987500        14908        80.00
  102563.839     0.989062        14929        91.43
  102694.911     0.990625        14952       106.67
  102825.983     0.992188        14975       128.00
  102891.519     0.992969        14985       142.22
  103022.591     0.993750        15005       160.00
  103088.127     0.994531        15016       182.86
  103153.663     0.995313        15027       213.33
  103219.199     0.996094        15035       256.00
  103284.735     0.996484        15046       284.44
  103284.735     0.996875        15046       320.00
  103350.271     0.997266        15055       365.71
  103350.271     0.997656        15055       426.67
  103415.807     0.998047        15067       512.00
  103415.807     0.998242        15067       568.89
  103415.807     0.998437        15067       640.00
  103481.343     0.998633        15073       731.43
  103481.343     0.998828        15073       853.33
  103546.879     0.999023        15079      1024.00
  103546.879     0.999121        15079      1137.78
  103546.879     0.999219        15079      1280.00
  103612.415     0.999316        15083      1462.86
  103612.415     0.999414        15083      1706.67
  103612.415     0.999512        15083      2048.00
  103677.951     0.999561        15087      2275.56
  103677.951     0.999609        15087      2560.00
  103677.951     0.999658        15087      2925.71
  103677.951     0.999707        15087      3413.33
  103677.951     0.999756        15087      4096.00
  103677.951     0.999780        15087      4551.11
  103743.487     0.999805        15089      5120.00
  103743.487     0.999829        15089      5851.43
  103743.487     0.999854        15089      6826.67
  103743.487     0.999878        15089      8192.00
  103743.487     0.999890        15089      9102.22
  103743.487     0.999902        15089     10240.00
  103743.487     0.999915        15089     11702.86
  103743.487     0.999927        15089     13653.33
  103809.023     0.999939        15090     16384.00
  103809.023     1.000000        15090          inf
#[Mean    =    56169.510, StdDeviation   =    27507.721]
#[Max     =   103743.488, Total count    =        15090]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16475 requests in 2.00m, 4.51MB read
  Non-2xx or 3xx responses: 16475
Requests/sec:    137.22
Transfer/sec:     38.46KB

Run #6:

Running 2m test @ https://api.thriveglobal.com
  12 threads and 23 connections
  Thread calibration: mean lat.: 4472.329ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 4484.088ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4505.017ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 4471.984ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 4527.123ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4525.566ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4483.621ms, rate sampling interval: 15638ms
  Thread calibration: mean lat.: 4506.398ms, rate sampling interval: 15613ms
  Thread calibration: mean lat.: 4528.971ms, rate sampling interval: 15671ms
  Thread calibration: mean lat.: 4475.863ms, rate sampling interval: 15409ms
  Thread calibration: mean lat.: 4527.290ms, rate sampling interval: 15663ms
  Thread calibration: mean lat.: 4481.972ms, rate sampling interval: 15613ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93m    27.25s    1.72m    57.67%
    Req/Sec    11.15      0.36    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93m
 75.000%    1.32m
 90.000%    1.56m
 99.000%    1.70m
 99.900%    1.72m
 99.990%    1.72m
 99.999%    1.72m
100.000%    1.72m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8617.983     0.000000            3         1.00
   17940.479     0.100000         1561         1.11
   27279.359     0.200000         3123         1.25
   36765.695     0.300000         4685         1.43
   46366.719     0.400000         6244         1.67
   55705.599     0.500000         7809         2.00
   60424.191     0.550000         8586         2.22
   65077.247     0.600000         9366         2.50
   69861.375     0.650000        10156         2.86
   74579.967     0.700000        10935         3.33
   79364.095     0.750000        11708         4.00
   81723.391     0.775000        12108         4.44
   84017.151     0.800000        12496         5.00
   86376.447     0.825000        12890         5.71
   88670.207     0.850000        13271         6.67
   91095.039     0.875000        13665         8.00
   92274.687     0.887500        13860         8.89
   93454.335     0.900000        14053        10.00
   94699.519     0.912500        14256        11.43
   95813.631     0.925000        14443        13.33
   96993.279     0.937500        14639        16.00
   97583.103     0.943750        14734        17.78
   98238.463     0.950000        14840        20.00
   98828.287     0.956250        14935        22.86
   99418.111     0.962500        15034        26.67
  100007.935     0.968750        15130        32.00
  100270.079     0.971875        15171        35.56
  100597.759     0.975000        15226        40.00
  100859.903     0.978125        15270        45.71
  101318.655     0.981250        15323        53.33
  101580.799     0.984375        15369        64.00
  101711.871     0.985938        15391        71.11
  101908.479     0.987500        15421        80.00
  102039.551     0.989062        15444        91.43
  102170.623     0.990625        15465       106.67
  102367.231     0.992188        15498       128.00
  102432.767     0.992969        15509       142.22
  102498.303     0.993750        15521       160.00
  102563.839     0.994531        15529       182.86
  102629.375     0.995313        15540       213.33
  102694.911     0.996094        15552       256.00
  102760.447     0.996484        15562       284.44
  102760.447     0.996875        15562       320.00
  102825.983     0.997266        15571       365.71
  102891.519     0.997656        15580       426.67
  102891.519     0.998047        15580       512.00
  102957.055     0.998242        15588       568.89
  102957.055     0.998437        15588       640.00
  103022.591     0.998633        15597       731.43
  103022.591     0.998828        15597       853.33
  103022.591     0.999023        15597      1024.00
  103022.591     0.999121        15597      1137.78
  103088.127     0.999219        15605      1280.00
  103088.127     0.999316        15605      1462.86
  103088.127     0.999414        15605      1706.67
  103088.127     0.999512        15605      2048.00
  103088.127     0.999561        15605      2275.56
  103088.127     0.999609        15605      2560.00
  103088.127     0.999658        15605      2925.71
  103153.663     0.999707        15609      3413.33
  103153.663     0.999756        15609      4096.00
  103153.663     0.999780        15609      4551.11
  103153.663     0.999805        15609      5120.00
  103153.663     0.999829        15609      5851.43
  103153.663     0.999854        15609      6826.67
  103153.663     0.999878        15609      8192.00
  103153.663     0.999890        15609      9102.22
  103153.663     0.999902        15609     10240.00
  103153.663     0.999915        15609     11702.86
  103153.663     0.999927        15609     13653.33
  103219.199     0.999939        15610     16384.00
  103219.199     1.000000        15610          inf
#[Mean    =    55683.429, StdDeviation   =    27253.626]
#[Max     =   103153.664, Total count    =        15610]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  16995 requests in 2.00m, 4.65MB read
  Non-2xx or 3xx responses: 16995
Requests/sec:    141.55
Transfer/sec:     39.67KB